Duet3D/CoreN2G/src/STMCubeMX/STM32H523.svd
        <register>
          <name>EXTI_EXTICR2</name>
          <displayName>EXTI_EXTICR2</displayName>
          <description>EXTI external interrupt selection register</description>
          <addressOffset>0x064</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EXTI4</name>
              <description>EXTI4 GPIO port selection
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x00</name>
                  <description>PA4 pin</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x01</name>
                  <description>PB4 pin</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x02</name>
                  <description>PC4 pin</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x03</name>
                  <description>PD4 pin</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x04</name>
                  <description>PE4 pin</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x05</name>
                  <description>PF4 pin</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x06</name>
                  <description>PG4 pin</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x07</name>
                  <description>PH4 pin</description>
                  <value>0x07</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x08</name>
                  <description>PI4 pin</description>
                  <value>0x08</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTI5</name>
              <description>EXTI5 GPIO port selection
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x00</name>
                  <description>PA5 pin</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x01</name>
                  <description>PB5 pin</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x02</name>
                  <description>PC5 pin</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x03</name>
                  <description>PD5 pin</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x04</name>
                  <description>PE5 pin</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x05</name>
                  <description>PF5 pin</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x06</name>
                  <description>PG5 pin</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x07</name>
                  <description>PH5 pin</description>
                  <value>0x07</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x08</name>
                  <description>PI5 pin</description>
                  <value>0x08</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTI6</name>
              <description>EXTI6 GPIO port selection
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x00</name>
                  <description>PA6 pin</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x01</name>
                  <description>PB6 pin</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x02</name>
                  <description>PC6 pin</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x03</name>
                  <description>PD6 pin</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x04</name>
                  <description>PE6 pin</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x05</name>
                  <description>PF6 pin</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x06</name>
                  <description>PG6 pin</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x07</name>
                  <description>PH6 pin</description>
                  <value>0x07</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x08</name>
                  <description>PI6 pin</description>
                  <value>0x08</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTI7</name>
              <description>EXTI7 GPIO port selection
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x00</name>
                  <description>PA7 pin</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x01</name>
                  <description>PB7 pin</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x02</name>
                  <description>PC7 pin</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x03</name>
                  <description>PD7 pin</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x04</name>
                  <description>PE7 pin</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x05</name>
                  <description>PF7 pin</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x06</name>
                  <description>PG7 pin</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x07</name>
                  <description>PH7 pin</description>
                  <value>0x07</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x08</name>
                  <description>PI7 pin</description>
                  <value>0x08</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI_EXTICR3</name>
          <displayName>EXTI_EXTICR3</displayName>
          <description>EXTI external interrupt selection register</description>
          <addressOffset>0x068</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EXTI8</name>
              <description>EXTI8 GPIO port selection
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x00</name>
                  <description>PA8 pin</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x01</name>
                  <description>PB8 pin</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x02</name>
                  <description>PC8 pin</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x03</name>
                  <description>PD8 pin</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x04</name>
                  <description>PE8 pin</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x05</name>
                  <description>PF8 pin</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x06</name>
                  <description>PG8 pin</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x07</name>
                  <description>PH8 pin</description>
                  <value>0x07</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x08</name>
                  <description>PI8 pin</description>
                  <value>0x08</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTI9</name>
              <description>EXTI9 GPIO port selection
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x00</name>
                  <description>PA9 pin</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x01</name>
                  <description>PB9 pin</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x02</name>
                  <description>PC9 pin</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x03</name>
                  <description>PD9 pin</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x04</name>
                  <description>PE9 pin</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x05</name>
                  <description>PF9 pin</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x06</name>
                  <description>PG9 pin</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x07</name>
                  <description>PH9 pin</description>
                  <value>0x07</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x08</name>
                  <description>PI9 pin</description>
                  <value>0x08</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTI10</name>
              <description>EXTI10 GPIO port selection
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x00</name>
                  <description>PA10 pin</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x01</name>
                  <description>PB10 pin</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x02</name>
                  <description>PC10 pin</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x03</name>
                  <description>PD10 pin</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x04</name>
                  <description>PE10 pin</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x05</name>
                  <description>PF10 pin</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x06</name>
                  <description>PG10 pin</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x07</name>
                  <description>PH10 pin</description>
                  <value>0x07</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x08</name>
                  <description>PI10 pin</description>
                  <value>0x08</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTI11</name>
              <description>EXTI11 GPIO port selection
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x00</name>
                  <description>PA11 pin</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x01</name>
                  <description>PB11 pin</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x02</name>
                  <description>PC11 pin</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x03</name>
                  <description>PD11 pin</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x04</name>
                  <description>PE11 pin</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x05</name>
                  <description>PF11 pin</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x06</name>
                  <description>PG11 pin</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x07</name>
                  <description>PH11 pin</description>
                  <value>0x07</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x08</name>
                  <description>PI11 pin</description>
                  <value>0x08</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI_LOCKR</name>
          <displayName>EXTI_LOCKR</displayName>
          <description>EXTI lock register</description>
          <addressOffset>0x070</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOCK</name>
              <description>Global security and privilege configuration registers (EXTI_SECCFGR and EXTI_PRIVCFGR) lock
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Security and privilege configuration open, can be modified.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Security and privilege configuration locked, can no longer be modified.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
